package com.qxf.archer.cookman.entity;

import java.util.List;

/**
 * 类描述：
 * <p>
 * 作者：Administrator on 2017/8/24 0024 15:19
 * 邮箱：377289596@qq.com
 */

public class CookLableEntity {

    /**
     * msg : success
     * result : {"curPage":1,"list":[{"ctgIds":["0010001007","0010001015","0010001031"],"ctgTitles":"荤菜,红烧,川菜","menuId":"00100010070000017731","name":"主席红烧肉","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439945926624.jpg","ingredients":"[\"五花肉一斤半洗净切约2厘米见方的块，葱半两切段，老姜一块拍破，花椒二十余粒，八角四、五个粒，三奈四、五粒，冰糖半两，红烧酱油三大匙，盐适量，鲜汤约二斤。\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945926890.jpg\",\"step\":\"1.将肉放锅内，加入鲜汤（清水也可）置旺火上烧沸，撇去浮沫\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945927086.jpg\",\"step\":\"2.放入葱、姜、花椒、盐、八角、三奈、冰糖、红烧酱油\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945927411.jpg\",\"step\":\"3.改用微火，一直保持沸面不腾，烧至汁浓肉粑，捡去姜、葱不要，起锅即成\"}]","sumary":"主席红烧肉属于川菜中的一道经典菜，它是四川、重庆许多地区许多人家接待重要客人才做的一道菜。主要原料是猪肉，口味是香，工艺是烧，难度属于中级。","title":"怎样做好川味经典主席红烧肉"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439945911619.jpg"},{"ctgIds":["0010001007","0010001015","0010001063"],"ctgTitles":"荤菜,红烧,养生","menuId":"00100010070000017714","name":"桂皮红烧肉","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439945871676.jpg","ingredients":"[\"原料：五花肉、八角、桂皮、香叶、姜、大蒜、冰糖。\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945871961.jpg\",\"step\":\"1.1、五花肉切成麻将大小的方块；入开水中焯一下；另起锅，不放油，直接烧热，下入焯好的五花肉小火煸炒；至肉皮表面变黄并逼出部分油脂，倒入老抽和生抽翻炒上色；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945872208.jpg\",\"step\":\"2.烹入料酒；下入八角、桂皮、香叶、姜、大蒜、冰糖，添加没过的热水；大火烧开后，撇净浮沫；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945872544.jpg\",\"step\":\"3.倒入砂锅大火烧开转小火慢炖；40分钟后添加适量盐，继续小火炖20分钟；开盖转大火收汁，注意不停翻动，至汤汁浓稠，全部裹住肉块且色泽发亮时，关火。\"}]","sumary":"红烧肉究竟有多少个版本有谁说得清红烧肉究竟有多少个版本？做红烧肉：有人先用冷水煮一下肉，有人先用开水焯一下肉，还有的人把肉直接下锅炒；有人焯水后把肉切块，有人把肉切块后再焯水；有人用糖先炒色，有人用冰糖先炒色，还有的人用老抽来上色；有人先煸炒肉来去除一部分油脂，有人不需要经过煎炒直接下锅煮肉；有人喜欢用这味调料，有人喜欢用那味调料；有人煮1个小时，有人煮2个小时；有人先用铁锅，再转砂锅，有人先用砂锅，再转铁锅；我想，有一百个人做红烧肉，那定会有100种风味。其实，不仅仅是红烧肉。食物，适合自己口味的，才是最好的。我喜欢酱油色味浓重的、透着淡淡的冰糖甜、香而不腻的红烧肉。","title":"怎样做桂皮红烧肉"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439945845263.jpg"},{"ctgIds":["0010001007","0010001020"],"ctgTitles":"荤菜,炖","menuId":"00100010070000017476","name":"红烧肉炖南瓜","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439945092615.jpg","ingredients":"[\"豆角 五花肉 1个 小南瓜 酱油 白糖 葱丝 姜片 花椒面\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945092816.jpg\",\"step\":\"1.猪五花切小块，用开水烫一下；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945092920.jpg\",\"step\":\"2.锅内热油入白糖，熬制焦糖色；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945093026.jpg\",\"step\":\"3.将烫过的猪五花入油锅炒上色，加点酱油提色；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945093232.jpg\",\"step\":\"4.将炒好的肉放入阿迪锅把南瓜洗净去瓤，切块放到肉块的上面；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945093430.jpg\",\"step\":\"5.锅调至肉档。要把豆角炒倒，添水加入红烧肉，加入姜片，开锅之后再把南瓜块放入，最后加盐，炖至汤干。\"}]","sumary":"天冷了，煲点汤，炖点菜吃着热乎乎的暖心暖胃~！爱吃肉的看到这到菜就知道该有多香了，只是做起来略麻烦些，得分两步走哈！","title":"怎样做红烧肉炖南瓜豆角"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439945057496.jpg"},{"ctgIds":["0010001007","0010001015","0010001058"],"ctgTitles":"荤菜,红烧,养胃","menuId":"00100010070000017386","name":"五香栗子红烧肉","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439944737138.jpg","ingredients":"[\"主料：五花肉(250克)、带壳板栗(400克)、葱(1根)、大葱(半根)、姜(2片)、蒜粒(3瓣) 　　\",\"香料：八角(1粒)、桂皮(1小块)、干辣椒(10只)、花椒(1汤匙)、月桂叶(2片) 　　\",\"调料：油(3汤匙)、海天铁强化草菇老抽(1/2汤匙)、海天金标生抽(1汤匙)、盐(1/4汤匙)、鸡粉(1/3汤匙)、生粉水(1/4杯)\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944737330.jpg\",\"step\":\"1.板栗去掉外壳，放入沸水中加盖焖5分钟左右，捞起过冷河沥干水。剥去栗衣，洗净栗子肉;五花肉洗净，切成厚块;葱切段，姜切片，干辣椒切圈;大葱拍扁也切段。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944737647.jpg\",\"step\":\"2.烧热1汤匙油，放入五花肉块，以中小火煸至出油，待其成焦黄色，捞起沥干油，洗净炒锅。烧热2汤匙油，先加入1汤匙花椒粒炒香，捞起弃之;再倒入葱白段、姜片、蒜粒、大葱段和所有香料炒香。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944737938.jpg\",\"step\":\"3.倒入五花肉，与锅内食材一同炒匀，注入2碗清水，以没过五花肉为宜。加入1/2汤匙海天铁强化草菇老抽和1汤匙海天金标生抽，加盖大火煮沸，改小火焖煮10分钟。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944738533.jpg\",\"step\":\"4.放入栗子肉拌匀，加盖以小火续焖30分钟，煮至栗肉软熟入味。加入1/4汤匙盐和1/3汤匙鸡粉调味，淋入1/4杯生粉水勾芡，洒入葱青段，即可起锅。\"}]","sumary":"秋天是栗子成熟的季节，栗子味甘，性温，入脾、胃、肾经；具有养胃健脾，补肾强筋，活血止血之功效。五香栗子红烧肉把栗子和红烧肉很好的结合在一起，使各自的美味都得到发挥，是一道秋季养生佳品！","title":"怎样做五香栗子红烧肉？"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439944721587.jpg"},{"ctgIds":["0010001007","0010001015","0010001063"],"ctgTitles":"荤菜,红烧,养生","menuId":"00100010070000017271","name":"红烧肉烧蛋","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439944240383.jpg","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240549.jpg\",\"step\":\"1.猪肉切成2厘米见方的块，最好用五花肉。放入冷水浸泡15分钟，冷水中加入少量料酒喝盐。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240677.jpg\",\"step\":\"2.猪肉焯水。水烧开，放入猪肉，水开后煮2-3分钟到猪肉变色。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240850.jpg\",\"step\":\"3.然后把水沥干，猪肉冷水冲干净。焯猪肉的水可以留着，把面上的沫去了备用。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240923.jpg\",\"step\":\"4.鸡蛋6-8个,煮成白煮蛋。冷水没过鸡蛋,水中加少许盐,水沸后煮5-8分钟,根据你需要的老嫩程度。煮好的蛋趁热加冷水冲一下,会很容易剥壳。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241088.jpg\",\"step\":\"5.在剥了壳的白煮蛋上用刀竖着划上几刀,这样等下煮起来好入味。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241250.jpg\",\"step\":\"6.熬冰糖(没冰糖的也可以用红糖)。小火锅中放入冰糖,熬至冰糖融化。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241406.jpg\",\"step\":\"7.继续熬直至冰糖的颜色变成褐色,有些冒泡为止。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241574.jpg\",\"step\":\"8.把红烧肉倒入糖浆中,大火快速翻炒直至每块肉都沾上糖浆,肉色变深。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241646.jpg\",\"step\":\"9.准备大葱、胡萝卜（可省）、欧洲萝卜（可省，也可用土豆代替），青圆椒（可省），都切成块。另外准备八角3个、桂皮少量（我只买到了八角，桂皮这里就省了）。胡萝卜我个人喜欢焯水后使用，此处凭个人喜好。另外，正宗的老上海红烧肉烧蛋是只有肉和蛋组成的，加入蔬菜是我个人的改良。主要家里两口人都不怎么爱吃蔬菜，可是蔬菜沾上肉汤肉汁，突然变的人人都爱吃了。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241810.jpg\",\"step\":\"10.欧洲萝卜的照片。长的像萝卜,其实口感和土豆基本一样,比土豆更糯一点,完全没一点萝卜的味道,不知道为啥叫欧洲萝卜。当时买它是因为我错把它当成了白萝卜，没想到阴差阳错的反而爱上了它。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242008.jpg\",\"step\":\"11.把大葱、胡萝卜块、欧洲萝卜块、园椒块和八角桂皮都倒入锅中。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242211.jpg\",\"step\":\"12.和红烧肉一起翻炒几下。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242318.jpg\",\"step\":\"13.换锅。先把白煮蛋放入新锅中，再把炒锅里所有的材料倒入，这样蛋在锅子的地步浸在汁水中，更容易焖的入味。有砂锅的最好用砂锅，老上海人认为砂锅煮出来的汤和卤水更香。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242441.jpg\",\"step\":\"14.锅中加入之前焯猪肉的水或者高汤。我用的是排骨汤。加汤（水）的多少看个人喜好，一般以没过材料为准。我家爱吃汁水多的菜，所以我水加的较多。然后加入少量老抽、糖（较多）、盐。小火炖40分钟到1个小时。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242605.jpg\",\"step\":\"15.出锅前加入少量鸡精（可省），大火勾芡，出锅。\"}]","sumary":"浓油赤酱、略带一丝甜味的\u201c老上海红烧肉焖蛋\u201d，好像是寒冬里的一把火，把人的心都烧的暖暖的。此菜可以反复烹制，典型的\u201c饭遭殃\u201d。另外，这个菜里蛋可比肉好吃多了，蛋吃完了可加入新的白煮蛋，其他材料也可反复加煮。第一天煮第二天吃更香。","title":"怎样自制红烧肉烧蛋"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439944217732.jpg"}],"total":151}
     * retCode : 200
     */

    private String msg;
    private ResultBean result;
    private String retCode;

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public ResultBean getResult() {
        return result;
    }

    public void setResult(ResultBean result) {
        this.result = result;
    }

    public String getRetCode() {
        return retCode;
    }

    public void setRetCode(String retCode) {
        this.retCode = retCode;
    }

    public static class ResultBean {
        /**
         * curPage : 1
         * list : [{"ctgIds":["0010001007","0010001015","0010001031"],"ctgTitles":"荤菜,红烧,川菜","menuId":"00100010070000017731","name":"主席红烧肉","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439945926624.jpg","ingredients":"[\"五花肉一斤半洗净切约2厘米见方的块，葱半两切段，老姜一块拍破，花椒二十余粒，八角四、五个粒，三奈四、五粒，冰糖半两，红烧酱油三大匙，盐适量，鲜汤约二斤。\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945926890.jpg\",\"step\":\"1.将肉放锅内，加入鲜汤（清水也可）置旺火上烧沸，撇去浮沫\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945927086.jpg\",\"step\":\"2.放入葱、姜、花椒、盐、八角、三奈、冰糖、红烧酱油\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945927411.jpg\",\"step\":\"3.改用微火，一直保持沸面不腾，烧至汁浓肉粑，捡去姜、葱不要，起锅即成\"}]","sumary":"主席红烧肉属于川菜中的一道经典菜，它是四川、重庆许多地区许多人家接待重要客人才做的一道菜。主要原料是猪肉，口味是香，工艺是烧，难度属于中级。","title":"怎样做好川味经典主席红烧肉"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439945911619.jpg"},{"ctgIds":["0010001007","0010001015","0010001063"],"ctgTitles":"荤菜,红烧,养生","menuId":"00100010070000017714","name":"桂皮红烧肉","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439945871676.jpg","ingredients":"[\"原料：五花肉、八角、桂皮、香叶、姜、大蒜、冰糖。\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945871961.jpg\",\"step\":\"1.1、五花肉切成麻将大小的方块；入开水中焯一下；另起锅，不放油，直接烧热，下入焯好的五花肉小火煸炒；至肉皮表面变黄并逼出部分油脂，倒入老抽和生抽翻炒上色；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945872208.jpg\",\"step\":\"2.烹入料酒；下入八角、桂皮、香叶、姜、大蒜、冰糖，添加没过的热水；大火烧开后，撇净浮沫；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945872544.jpg\",\"step\":\"3.倒入砂锅大火烧开转小火慢炖；40分钟后添加适量盐，继续小火炖20分钟；开盖转大火收汁，注意不停翻动，至汤汁浓稠，全部裹住肉块且色泽发亮时，关火。\"}]","sumary":"红烧肉究竟有多少个版本有谁说得清红烧肉究竟有多少个版本？做红烧肉：有人先用冷水煮一下肉，有人先用开水焯一下肉，还有的人把肉直接下锅炒；有人焯水后把肉切块，有人把肉切块后再焯水；有人用糖先炒色，有人用冰糖先炒色，还有的人用老抽来上色；有人先煸炒肉来去除一部分油脂，有人不需要经过煎炒直接下锅煮肉；有人喜欢用这味调料，有人喜欢用那味调料；有人煮1个小时，有人煮2个小时；有人先用铁锅，再转砂锅，有人先用砂锅，再转铁锅；我想，有一百个人做红烧肉，那定会有100种风味。其实，不仅仅是红烧肉。食物，适合自己口味的，才是最好的。我喜欢酱油色味浓重的、透着淡淡的冰糖甜、香而不腻的红烧肉。","title":"怎样做桂皮红烧肉"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439945845263.jpg"},{"ctgIds":["0010001007","0010001020"],"ctgTitles":"荤菜,炖","menuId":"00100010070000017476","name":"红烧肉炖南瓜","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439945092615.jpg","ingredients":"[\"豆角 五花肉 1个 小南瓜 酱油 白糖 葱丝 姜片 花椒面\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945092816.jpg\",\"step\":\"1.猪五花切小块，用开水烫一下；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945092920.jpg\",\"step\":\"2.锅内热油入白糖，熬制焦糖色；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945093026.jpg\",\"step\":\"3.将烫过的猪五花入油锅炒上色，加点酱油提色；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945093232.jpg\",\"step\":\"4.将炒好的肉放入阿迪锅把南瓜洗净去瓤，切块放到肉块的上面；\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945093430.jpg\",\"step\":\"5.锅调至肉档。要把豆角炒倒，添水加入红烧肉，加入姜片，开锅之后再把南瓜块放入，最后加盐，炖至汤干。\"}]","sumary":"天冷了，煲点汤，炖点菜吃着热乎乎的暖心暖胃~！爱吃肉的看到这到菜就知道该有多香了，只是做起来略麻烦些，得分两步走哈！","title":"怎样做红烧肉炖南瓜豆角"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439945057496.jpg"},{"ctgIds":["0010001007","0010001015","0010001058"],"ctgTitles":"荤菜,红烧,养胃","menuId":"00100010070000017386","name":"五香栗子红烧肉","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439944737138.jpg","ingredients":"[\"主料：五花肉(250克)、带壳板栗(400克)、葱(1根)、大葱(半根)、姜(2片)、蒜粒(3瓣) 　　\",\"香料：八角(1粒)、桂皮(1小块)、干辣椒(10只)、花椒(1汤匙)、月桂叶(2片) 　　\",\"调料：油(3汤匙)、海天铁强化草菇老抽(1/2汤匙)、海天金标生抽(1汤匙)、盐(1/4汤匙)、鸡粉(1/3汤匙)、生粉水(1/4杯)\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944737330.jpg\",\"step\":\"1.板栗去掉外壳，放入沸水中加盖焖5分钟左右，捞起过冷河沥干水。剥去栗衣，洗净栗子肉;五花肉洗净，切成厚块;葱切段，姜切片，干辣椒切圈;大葱拍扁也切段。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944737647.jpg\",\"step\":\"2.烧热1汤匙油，放入五花肉块，以中小火煸至出油，待其成焦黄色，捞起沥干油，洗净炒锅。烧热2汤匙油，先加入1汤匙花椒粒炒香，捞起弃之;再倒入葱白段、姜片、蒜粒、大葱段和所有香料炒香。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944737938.jpg\",\"step\":\"3.倒入五花肉，与锅内食材一同炒匀，注入2碗清水，以没过五花肉为宜。加入1/2汤匙海天铁强化草菇老抽和1汤匙海天金标生抽，加盖大火煮沸，改小火焖煮10分钟。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944738533.jpg\",\"step\":\"4.放入栗子肉拌匀，加盖以小火续焖30分钟，煮至栗肉软熟入味。加入1/4汤匙盐和1/3汤匙鸡粉调味，淋入1/4杯生粉水勾芡，洒入葱青段，即可起锅。\"}]","sumary":"秋天是栗子成熟的季节，栗子味甘，性温，入脾、胃、肾经；具有养胃健脾，补肾强筋，活血止血之功效。五香栗子红烧肉把栗子和红烧肉很好的结合在一起，使各自的美味都得到发挥，是一道秋季养生佳品！","title":"怎样做五香栗子红烧肉？"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439944721587.jpg"},{"ctgIds":["0010001007","0010001015","0010001063"],"ctgTitles":"荤菜,红烧,养生","menuId":"00100010070000017271","name":"红烧肉烧蛋","recipe":{"img":"http://f2.mob.com/null/2015/08/19/1439944240383.jpg","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240549.jpg\",\"step\":\"1.猪肉切成2厘米见方的块，最好用五花肉。放入冷水浸泡15分钟，冷水中加入少量料酒喝盐。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240677.jpg\",\"step\":\"2.猪肉焯水。水烧开，放入猪肉，水开后煮2-3分钟到猪肉变色。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240850.jpg\",\"step\":\"3.然后把水沥干，猪肉冷水冲干净。焯猪肉的水可以留着，把面上的沫去了备用。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944240923.jpg\",\"step\":\"4.鸡蛋6-8个,煮成白煮蛋。冷水没过鸡蛋,水中加少许盐,水沸后煮5-8分钟,根据你需要的老嫩程度。煮好的蛋趁热加冷水冲一下,会很容易剥壳。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241088.jpg\",\"step\":\"5.在剥了壳的白煮蛋上用刀竖着划上几刀,这样等下煮起来好入味。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241250.jpg\",\"step\":\"6.熬冰糖(没冰糖的也可以用红糖)。小火锅中放入冰糖,熬至冰糖融化。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241406.jpg\",\"step\":\"7.继续熬直至冰糖的颜色变成褐色,有些冒泡为止。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241574.jpg\",\"step\":\"8.把红烧肉倒入糖浆中,大火快速翻炒直至每块肉都沾上糖浆,肉色变深。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241646.jpg\",\"step\":\"9.准备大葱、胡萝卜（可省）、欧洲萝卜（可省，也可用土豆代替），青圆椒（可省），都切成块。另外准备八角3个、桂皮少量（我只买到了八角，桂皮这里就省了）。胡萝卜我个人喜欢焯水后使用，此处凭个人喜好。另外，正宗的老上海红烧肉烧蛋是只有肉和蛋组成的，加入蔬菜是我个人的改良。主要家里两口人都不怎么爱吃蔬菜，可是蔬菜沾上肉汤肉汁，突然变的人人都爱吃了。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944241810.jpg\",\"step\":\"10.欧洲萝卜的照片。长的像萝卜,其实口感和土豆基本一样,比土豆更糯一点,完全没一点萝卜的味道,不知道为啥叫欧洲萝卜。当时买它是因为我错把它当成了白萝卜，没想到阴差阳错的反而爱上了它。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242008.jpg\",\"step\":\"11.把大葱、胡萝卜块、欧洲萝卜块、园椒块和八角桂皮都倒入锅中。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242211.jpg\",\"step\":\"12.和红烧肉一起翻炒几下。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242318.jpg\",\"step\":\"13.换锅。先把白煮蛋放入新锅中，再把炒锅里所有的材料倒入，这样蛋在锅子的地步浸在汁水中，更容易焖的入味。有砂锅的最好用砂锅，老上海人认为砂锅煮出来的汤和卤水更香。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242441.jpg\",\"step\":\"14.锅中加入之前焯猪肉的水或者高汤。我用的是排骨汤。加汤（水）的多少看个人喜好，一般以没过材料为准。我家爱吃汁水多的菜，所以我水加的较多。然后加入少量老抽、糖（较多）、盐。小火炖40分钟到1个小时。\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439944242605.jpg\",\"step\":\"15.出锅前加入少量鸡精（可省），大火勾芡，出锅。\"}]","sumary":"浓油赤酱、略带一丝甜味的\u201c老上海红烧肉焖蛋\u201d，好像是寒冬里的一把火，把人的心都烧的暖暖的。此菜可以反复烹制，典型的\u201c饭遭殃\u201d。另外，这个菜里蛋可比肉好吃多了，蛋吃完了可加入新的白煮蛋，其他材料也可反复加煮。第一天煮第二天吃更香。","title":"怎样自制红烧肉烧蛋"},"thumbnail":"http://f2.mob.com/null/2015/08/19/1439944217732.jpg"}]
         * total : 151
         */

        private int curPage;
        private int total;
        private List<ListBean> list;

        public int getCurPage() {
            return curPage;
        }

        public void setCurPage(int curPage) {
            this.curPage = curPage;
        }

        public int getTotal() {
            return total;
        }

        public void setTotal(int total) {
            this.total = total;
        }

        public List<ListBean> getList() {
            return list;
        }

        public void setList(List<ListBean> list) {
            this.list = list;
        }

        public static class ListBean {
            /**
             * ctgIds : ["0010001007","0010001015","0010001031"]
             * ctgTitles : 荤菜,红烧,川菜
             * menuId : 00100010070000017731
             * name : 主席红烧肉
             * recipe : {"img":"http://f2.mob.com/null/2015/08/19/1439945926624.jpg","ingredients":"[\"五花肉一斤半洗净切约2厘米见方的块，葱半两切段，老姜一块拍破，花椒二十余粒，八角四、五个粒，三奈四、五粒，冰糖半两，红烧酱油三大匙，盐适量，鲜汤约二斤。\"]","method":"[{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945926890.jpg\",\"step\":\"1.将肉放锅内，加入鲜汤（清水也可）置旺火上烧沸，撇去浮沫\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945927086.jpg\",\"step\":\"2.放入葱、姜、花椒、盐、八角、三奈、冰糖、红烧酱油\"},{\"img\":\"http://f2.mob.com/null/2015/08/19/1439945927411.jpg\",\"step\":\"3.改用微火，一直保持沸面不腾，烧至汁浓肉粑，捡去姜、葱不要，起锅即成\"}]","sumary":"主席红烧肉属于川菜中的一道经典菜，它是四川、重庆许多地区许多人家接待重要客人才做的一道菜。主要原料是猪肉，口味是香，工艺是烧，难度属于中级。","title":"怎样做好川味经典主席红烧肉"}
             * thumbnail : http://f2.mob.com/null/2015/08/19/1439945911619.jpg
             */

            private String ctgTitles;
            private String menuId;
            private String name;
            private RecipeBean recipe;
            private String thumbnail;
            private List<String> ctgIds;

            public String getCtgTitles() {
                return ctgTitles;
            }

            public void setCtgTitles(String ctgTitles) {
                this.ctgTitles = ctgTitles;
            }

            public String getMenuId() {
                return menuId;
            }

            public void setMenuId(String menuId) {
                this.menuId = menuId;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public RecipeBean getRecipe() {
                return recipe;
            }

            public void setRecipe(RecipeBean recipe) {
                this.recipe = recipe;
            }

            public String getThumbnail() {
                return thumbnail;
            }

            public void setThumbnail(String thumbnail) {
                this.thumbnail = thumbnail;
            }

            public List<String> getCtgIds() {
                return ctgIds;
            }

            public void setCtgIds(List<String> ctgIds) {
                this.ctgIds = ctgIds;
            }

            public static class RecipeBean {
                /**
                 * img : http://f2.mob.com/null/2015/08/19/1439945926624.jpg
                 * ingredients : ["五花肉一斤半洗净切约2厘米见方的块，葱半两切段，老姜一块拍破，花椒二十余粒，八角四、五个粒，三奈四、五粒，冰糖半两，红烧酱油三大匙，盐适量，鲜汤约二斤。"]
                 * method : [{"img":"http://f2.mob.com/null/2015/08/19/1439945926890.jpg","step":"1.将肉放锅内，加入鲜汤（清水也可）置旺火上烧沸，撇去浮沫"},{"img":"http://f2.mob.com/null/2015/08/19/1439945927086.jpg","step":"2.放入葱、姜、花椒、盐、八角、三奈、冰糖、红烧酱油"},{"img":"http://f2.mob.com/null/2015/08/19/1439945927411.jpg","step":"3.改用微火，一直保持沸面不腾，烧至汁浓肉粑，捡去姜、葱不要，起锅即成"}]
                 * sumary : 主席红烧肉属于川菜中的一道经典菜，它是四川、重庆许多地区许多人家接待重要客人才做的一道菜。主要原料是猪肉，口味是香，工艺是烧，难度属于中级。
                 * title : 怎样做好川味经典主席红烧肉
                 */

                private String img;
                private String ingredients;
                private String method;
                private String sumary;
                private String title;

                public String getImg() {
                    return img;
                }

                public void setImg(String img) {
                    this.img = img;
                }

                public String getIngredients() {
                    return ingredients;
                }

                public void setIngredients(String ingredients) {
                    this.ingredients = ingredients;
                }

                public String getMethod() {
                    return method;
                }

                public void setMethod(String method) {
                    this.method = method;
                }

                public String getSumary() {
                    return sumary;
                }

                public void setSumary(String sumary) {
                    this.sumary = sumary;
                }

                public String getTitle() {
                    return title;
                }

                public void setTitle(String title) {
                    this.title = title;
                }
            }
        }
    }
}
